null/xdslog/sentMessages/2015/5/12/sent_ProvideAndRegisterDocumentSet-b_null#d098e66c-ec15-4102-a960-f876c7ec2695.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
<S:Header>
<To xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">http://iol.test.ohie.org:5001/xdsrepository</To>
<Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</Action>
<ReplyTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo>
<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:d098e66c-ec15-4102-a960-f876c7ec2695</MessageID>
</S:Header>
<S:Body>
<ns4:ProvideAndRegisterDocumentSetRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns4="urn:ihe:iti:xds-b:2007" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
<ns3:SubmitObjectsRequest>
<RegistryObjectList>
<ExtrinsicObject id="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e" mimeType="text/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
<Slot name="creationTime">
<ValueList>
<Value>20150504</Value>
</ValueList>
</Slot>
<Slot name="languageCode">
<ValueList>
<Value>en-us</Value>
</ValueList>
</Slot>
<Slot name="serviceStartTime">
<ValueList>
<Value>201505041006</Value>
</ValueList>
</Slot>
<Slot name="serviceStopTime">
<ValueList>
<Value>201505041006</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientId">
<ValueList>
<Value>9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientInfo">
<ValueList>
<Value>PID-3|9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
<Value>PID-5|Perez^May</Value>
<Value>PID-7|19910606</Value>
<Value>PID-8|F</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Immunization History"/>
</Name>
<Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e" id="urn:uuid:fbf49d3c-4dfc-42bb-bb8c-035f5505240c" nodeRepresentation="">
<Slot name="authorPerson">
<ValueList>
<Value>8812399^^^^^^^^&amp;2.25.309768652999692686176651983274504471835.646.3.4&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="authorInstitution">
<ValueList>
<Value>Dr. Family's Family Health Practice</Value>
</ValueList>
</Slot>
<Slot name="authorRole">
<ValueList>
<Value>Attending</Value>
</ValueList>
</Slot>
</Classification>
<Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e" id="urn:uuid:0b186b36-835b-4971-bc92-37c17cece3d7" nodeRepresentation="Outpatient Care">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon practiceSettingCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Outpatient Care"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e" id="urn:uuid:3643e822-9486-4e0f-8b76-84648cb2dc26" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e" id="urn:uuid:14d6807c-3b63-4c85-9cf6-63d54ffa3c4b" nodeRepresentation="1.3.6.1.4.1.21367.2006.7.101">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon confidentialityCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Normal"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e" id="urn:uuid:3908e4f8-f6e8-4d5e-a909-07917ef8d4bf" nodeRepresentation="urn:ihe:pcc:aps:2007">
<Slot name="codingScheme">
<ValueList>
<Value>1.3.6.1.4.1.19376.1.2.3</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="urn:ihe:pcc:aps:2007"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e" id="urn:uuid:3288a718-8cf8-4ebb-916d-886543ca1f7a" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e" id="urn:uuid:a1578ccf-76f8-4bcb-a801-76d2f2923a4b" nodeRepresentation="PC">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.5.11</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Primary Care Clinic"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:db0291bc-6d61-49ec-8bd4-6ac0b2c76d40" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" registryObject="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e" value="9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO">
<Name>
<LocalizedString value="XDSDocumentEntry.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:fdde04d5-48cf-4d58-bc34-43de1abdd768" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" registryObject="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e" value="2.16.840.1.113883.3.72.5.9.1.0.5386503746879679418111111111">
<Name>
<LocalizedString value="XDSDocumentEntry.uniqueId"/>
</Name>
</ExternalIdentifier>
</ExtrinsicObject>
<RegistryPackage id="urn:uuid:42dad2fc-83db-4361-8393-26f254e65f55">
<Slot name="submissionTime">
<ValueList>
<Value>20150504110603</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="SMS Gateway Package"/>
</Name>
<Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="urn:uuid:42dad2fc-83db-4361-8393-26f254e65f55" id="urn:uuid:54533d8e-590a-4046-a7e8-3d819cc276f9" nodeRepresentation="">
<Slot name="authorPerson">
<ValueList>
<Value>8812399^^^^^^^^&amp;2.25.309768652999692686176651983274504471835.646.3.4&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="authorInstitution">
<ValueList>
<Value>Dr. Family's Family Health Practice</Value>
</ValueList>
</Slot>
<Slot name="authorRole">
<ValueList>
<Value>Attending</Value>
</ValueList>
</Slot>
</Classification>
<Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="urn:uuid:42dad2fc-83db-4361-8393-26f254e65f55" id="urn:uuid:c35b77ee-65a6-478d-93be-d75438158f6e" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:fd8dc6c4-4990-4aa5-acb5-c54de40a6eeb" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" registryObject="urn:uuid:42dad2fc-83db-4361-8393-26f254e65f55" value="9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO">
<Name>
<LocalizedString value="XDSSubmissionSet.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:5abcac60-0967-424f-8f90-322ee2842b38" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" registryObject="urn:uuid:42dad2fc-83db-4361-8393-26f254e65f55" value="2.16.840.1.113883.3.72.5.9.1.1.5549314503269722202111111111">
<Name>
<LocalizedString value="XDSSubmissionSet.uniqueId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:76946619-eb0f-4164-b8af-4523518b3438" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" registryObject="urn:uuid:42dad2fc-83db-4361-8393-26f254e65f55" value="2.16.840.1.113883.3.72.5.9.1.2.5190328671848149170">
<Name>
<LocalizedString value="XDSSubmissionSet.sourceId"/>
</Name>
</ExternalIdentifier>
</RegistryPackage>
<Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="urn:uuid:42dad2fc-83db-4361-8393-26f254e65f55" id="urn:uuid:27529946-5646-4177-a88f-6843edbe0c84"/>
<Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="urn:uuid:ba694b4e-1833-4256-8557-5a0218280d2f" sourceObject="urn:uuid:42dad2fc-83db-4361-8393-26f254e65f55" targetObject="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e">
<Slot name="SubmissionSetStatus">
<ValueList>
<Value>Original</Value>
</ValueList>
</Slot>
</Association>
</RegistryObjectList>
</ns3:SubmitObjectsRequest>
<ns4:Document id="urn:uuid:7f3e2e63-99cd-499a-b069-0a7c079d9a4e">
<xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:247a28cb-48b8-461e-a3ea-4ec922d1f19a"/>
</ns4:Document>
</ns4:ProvideAndRegisterDocumentSetRequest>
</S:Body>
</S:Envelope>
